In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv("/data/movielens/movies.csv")
ratings = pd.read_csv("/data/movielens/ratings.csv")

In [3]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [5]:
movies.shape

(9125, 3)

In [6]:
ratings.shape

(100004, 4)

In [7]:
movies[movies.title.str.contains("Godfather")]

      movieId                            title                        genres
695       858            Godfather, The (1972)                   Crime|Drama
977      1221   Godfather: Part II, The (1974)                   Crime|Drama
1585     2023  Godfather: Part III, The (1990)  Crime|Drama|Mystery|Thriller
5470     8607          Tokyo Godfathers (2003)     Adventure|Animation|Drama

In [8]:
movies.loc[695, "movieId"]

858

In [12]:
list(movies[movies.title == "Godfather, The (1972)"].movieId)[0]

858

In [14]:
ratings[ratings.movieId == 858].shape

(200, 4)

In [16]:
rating_avg = ratings.groupby("movieId").rating.agg(["count","mean"])
rating_avg

         count      mean
movieId
1          247  3.872470
2          107  3.401869
3           59  3.161017
4           13  2.384615
5           56  3.267857
6          104  3.884615
7           53  3.283019
8            5  3.800000
9           20  3.150000
10         122  3.450820
11          82  3.689024
12          18  2.861111
13           8  3.937500
14          31  3.451613
15          11  2.318182
16          88  3.948864
17          86  3.924419
18          26  3.288462
19          92  2.597826
20          13  2.538462
21          95  3.536842
22          38  3.355263
23          22  3.090909
24          34  3.044118
25         101  3.742574
26           5  4.100000
27           7  3.142857
28          18  4.083333
29          40  4.025000
30          10  4.050000
...        ...       ...
158238       2  3.750000
158314       1  4.500000
158528       1  3.500000
158956       1  4.000000
159093       2  2.000000
159462       1  3.000000
159690       1  2.000000
159755       1  1.000000
159858       2  3.750000
159972       1  0.500000
160080       1  1.000000
160271       1  2.500000
160438       2  4.250000
160440       1  1.500000
160563       2  2.500000
160565       1  2.000000
160567       1  4.000000
160590       1  5.000000
160656       1  3.500000
160718       1  4.000000
161084       1  2.500000
161155       1  0.500000
161594       1  3.000000
161830       1  1.000000
161918       1  1.500000
161944       1  5.000000
162376       1  4.500000
162542       1  5.000000
162672       1  3.000000
163949       1  5.000000

[9066 rows x 2 columns]

In [17]:
rating_avg.loc[858, :]

count    200.0000
mean       4.4875
Name: 858, dtype: float64

In [18]:
rating_avg_top_100 = rating_avg[rating_avg["count"]>100]
rating_avg_top_100.shape

(149, 2)

In [22]:
top_10 = rating_avg_top_100.sort_values("mean", ascending = False).iloc[:10, :]

In [23]:
top_10

         count      mean
movieId
858        200  4.487500
318        311  4.487138
1221       135  4.385185
50         201  4.370647
527        244  4.303279
1193       144  4.256944
608        224  4.256696
296        324  4.256173
2858       220  4.236364
58559      121  4.235537

In [25]:
top_10.merge(movies, on = "movieId")[["movieId", "mean", "title"]]

   movieId      mean                                   title
0      858  4.487500                   Godfather, The (1972)
1      318  4.487138        Shawshank Redemption, The (1994)
2     1221  4.385185          Godfather: Part II, The (1974)
3       50  4.370647              Usual Suspects, The (1995)
4      527  4.303279                 Schindler's List (1993)
5     1193  4.256944  One Flew Over the Cuckoo's Nest (1975)
6      608  4.256696                            Fargo (1996)
7      296  4.256173                     Pulp Fiction (1994)
8     2858  4.236364                  American Beauty (1999)
9    58559  4.235537                 Dark Knight, The (2008)